main.floors.B01=
{
    "floorId": "B01",
    "title": "魔塔 1F",
    "name": "B01",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "item_ratio": 1,
    "defaultGround": "ground",
    "bgm": "bgm2.mp3",
    "firstArrive": [
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    9
                ]
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,2": [
            "\t[魔神·些多,skeletonKing]这位冒险家战士，看来你的运气很不错！竟然有命来到这里！",
            "\t[勇者,hero]还没离开这儿我怎么能死掉呀！快告诉我出口在哪里！",
            "\t[魔神·些多,skeletonKing]我有一个更好的提案，待我把你们解决掉后再引导你们回去不是比较简单吗？哈哈哈...",
            "\t[勇者,hero]那就让我领教你的本领吧！要上了！",
            "\t[公主,princess]好的！我在旁支援你！",
            "\t[魔神·些多,skeletonKing]很大的口气嘛！就看看你们能把我怎样！",
            {
                "type": "hide",
                "time": 0
            }
        ]
    },
    "changeFloor": {
        "6,9": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "afterBattle": {
        "6,1": [
            "\t[魔神·些多,skeletonKing]呀! ...人类怎么可能有这个力量! ",
            "\t[勇者,hero]没错你是很强大！可是现在的我还不能死！！咳...！",
            "\t[魔神·些多,skeletonKing]哈哈哈...没关系了，反正魔界之王已经率领大军到你们的世界进行占领了！",
            "\t[魔神 · 些多,skeletonKing]如果行动顺利的话，你们那里早被我们占领了！！！引诱你来只是调虎离山之计！哈哈哈",
            "\t[勇者,hero]可恶！怎么会这样！",
            "\t[魔神·些多,skeletonKing]......反正你现在也做不了什么...我告诉你，真正的出口真的就是在你进来的地方。",
            "\t[魔神·些多,skeletonKing]哈哈，快点回去看看自己的家园被破坏成怎样吧! .....鸣呀......",
            "\t[勇者,hero]断气了，我们快回去！可能还赶得及的！",
            "\t[公主,princess]好的！我也很担心了...",
            "\t[勇者,hero]不用担心，我一定会把所有魔物消灭的！",
            "\t[公主,princess]好...谢谢你。",
            {
                "type": "setBlock",
                "number": "I312"
            },
            {
                "type": "show",
                "loc": [
                    [
                        6,
                        9
                    ]
                ]
            },
            {
                "type": "setFloor",
                "name": "canFlyFrom",
                "value": true
            },
            {
                "type": "function",
                "function": "function(){\ncore.plugin.getAchievement(36);\n}"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {
        "6,6": {
            "1": null
        },
        "6,3": {
            "1": null
        }
    },
    "cannotMove": {},
    "map": [
    [343,343,343,343,343,343,343,343,343,343,343,343,343],
    [343,  0, 55,  0,343, 11,238, 11,343, 27, 28, 27,343],
    [343,343, 81,343,343,343,  0,343,343,  0,343,  0,343],
    [343,  0, 32,  0,343,343, 85,343,343, 33, 33, 33,343],
    [343, 31,343, 31,343,237,  0,237,343,343, 82,343,343],
    [343,  0, 32,  0,343,343, 86,343,343, 27, 11, 27,343],
    [343,343, 81,343,343,343, 85,343,343, 11,343, 11,343],
    [343, 32, 32, 32,343,228,  0,228,343, 28, 11, 28,343],
    [343, 83,343,343,343,  0,  0,  0,343,343,343, 83,343],
    [343,  0,249,  0, 86,  0, 87,  0, 86,  0,244,  0,343],
    [343,  5,  5,  5,  5,  0, 11,  0,  5,  5,  5,  5,343],
    [343,  5,  5,  5,  5,  5, 50,  5,  5,  5,  5,  5,343],
    [343,343,343,343,343,343,343,343,343,343,343,343,343]
],
    "bgmap": [

],
    "fgmap": [

],
    "underGround": true,
    "beforeBattle": {},
    "cannotMoveIn": {}
}