main.floors.B10=
{
    "floorId": "B10",
    "title": "魔塔 10F",
    "name": "B10",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "item_ratio": 1,
    "defaultGround": "ground",
    "bgm": "bgm2.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "4,6": [
            "\t[行装商人,N401]作为一个商人，我应该要劝你查看清楚身上的道具是否足够才继续前进...",
            "\t[行装商人,N401]万一在不能使用黄金色羽根的楼层才发现道具不足时就一切太迟了！",
            "\t[行装商人,N401]为免招致不必要损失或卡关，你还是留点钱准备足够的道具吧！",
            "\t[勇者,hero]谢谢你，我会注意的！"
        ]
    },
    "changeFloor": {
        "7,1": {
            "floorId": "B11",
            "stair": "downFloor"
        },
        "1,11": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [343,343,343,343,343,343,343,343,343,343,343,343,343],
    [343, 55,343,343,  0,223,  0, 87,343,  0,  0, 27,343],
    [343,382,343,343,  0,343,343,343,343,220, 28, 31,343],
    [343,220,343,343,  0,223,323,323,343, 82,343,343,343],
    [343,396,  0,343,378,255,  0,  0,343, 33,382, 33,343],
    [343,343,  0,343,  0,  0,396,227,343,382,  0,  0,343],
    [343,343, 82,343,410, 32,230,  0,343,343,343, 82,343],
    [343, 33,227,343,343,343,343,  0,343, 23,382,  0,343],
    [343,  0,  0,  0,  0,255,378,  0,343,343,343,230,343],
    [343,343,  0,  0,378,255,  0,  0,343, 29,220,  0,343],
    [343,  0,378,343,343,343,343,343,343,220,  0,  0,343],
    [343, 88,  0,  0,223,230,223,  0,  0,  0,  0, 33,343],
    [343,343,343,343,343,343,343,343,343,343,343,343,343]
],
    "bgmap": [

],
    "fgmap": [

],
    "underGround": true,
    "beforeBattle": {},
    "cannotMoveIn": {}
}