main.floors.B19=
{
    "floorId": "B19",
    "title": "魔塔 19F",
    "name": "B19",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "item_ratio": 1,
    "defaultGround": "ground",
    "bgm": "bgm2.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "7,2": [
            "\t[小妖精,fairy]公主所佩戴的饰物有抗魔效能，可抵抗魔法攻击的伤害啊~",
            "\t[公主,princess]难怪被魔法击中时好像不怎有感觉..."
        ],
        "1,4": [
            "\t[商人,N410]哇！连卖能力的神都被干掉了... \n财物真的要小心保管了...",
            "\t[商人,N410]以我所知，不久的层数下有另一\n个经验之神...如果它还在的话。\n你可以去找找看。"
        ]
    },
    "changeFloor": {
        "11,10": {
            "floorId": ":next",
            "time": 500
        },
        "11,3": {
            "floorId": ":before",
            "time": 500
        },
        "4,1": {
            "floorId": ":next",
            "time": 500
        },
        "1,1": {
            "floorId": ":before",
            "time": 500
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [343,343,343,343,343,343,343,343,343,343,343,343,343],
    [343, 88,  0,  3, 87,  3,  3,  3,  3,  3,  3,  3,343],
    [343,  3,  0,  3,  0,  0,  3,124,235,219,235,  0,343],
    [343,  0,  3, 11,  3,  0,  0,  3, 32,  0,  3, 88,343],
    [343,410,  3,323,  0,  3,  0,234,  3, 81,  0,  3,343],
    [343,  0, 23,  9,234, 10,256,  0,  3,  0,377,  3,343],
    [343,377,377,  3,256,  3,  0,234,  3,  3,235,  3,343],
    [343, 81,  3,  0,  0,  3,256,  0,  3,  3,377,  3,343],
    [343,246,  0,  0,  3, 34,  0,333,  3,  0,  0,  3,343],
    [343,  0,  3,  3,  0,377,  0,  3,  0, 81,  3,  3,343],
    [343, 55,  0,246,  0, 31,  3, 27,377,  3,  3, 87,343],
    [343,  3,  3,  3,  3,  3, 28,219,  0,  0,  0,  0,343],
    [343,343,343,343,343,343,343,343,343,343,343,343,343]
],
    "bgmap": [

],
    "fgmap": [

],
    "downFloor": [
        11,
        3
    ],
    "upFloor": [
        11,
        10
    ],
    "underGround": true,
    "beforeBattle": {},
    "cannotMoveIn": {}
}