main.floors.B24=
{
    "floorId": "B24",
    "title": "魔塔 24F",
    "name": "B24",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "item_ratio": 1,
    "defaultGround": "ground",
    "bgm": "bgm1.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "1,3": [
            "\t[阴险老人,man]听说这座塔中有几颗极珍贵的水晶球，据闻这些水晶球充满灵气，放置的地方因灵气影响而充满水分。但还没有找到它们的人...",
            "\t[阴险老人,man]这么珍贵的东西要是能让我找到的话...\n嘿嘿。"
        ],
        "11,1": [
            "\t[老人,N409]这塔有一种很难对付的怪物！我们称它为白银系怪物。因为要使用特殊的战斗方式才能战胜它们。",
            "\t[老人,N409]但要取胜也不是易事，你必须有必死的决心去挑战它们！\n战况不妙时就按 Q 逃跑吧。",
            "系统提示：\n复刻版的白银系怪物直接白给。"
        ]
    },
    "changeFloor": {
        "4,6": {
            "floorId": ":next",
            "time": 500
        },
        "1,11": {
            "floorId": ":before",
            "time": 500
        },
        "1,1": {
            "floorId": ":before",
            "time": 500
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [343,343,343,343,343,343,343,343,343,343,343,343,343],
    [343, 88,  0,218,214,218,  0,  0, 11,  1,214,409,343],
    [343,  1,  1,  1,  1,  1,  1,  1,  0,  1,  0,  1,343],
    [343,121, 21,  0,211,  0,  0,  1,  0,  1,  0,  1,343],
    [343, 21,  0,  0, 11,  1,  0,  1,  0,  1,  0,  1,343],
    [343,  0,  0,  1,  1,  1,  0,  1,  0,  1,211,  1,343],
    [343,  0,  0,  1, 87,  0, 81,211,334,  1,211,  1,343],
    [343,  1,214,  1,  1,  1,  0,  1,  0,  1,  0,  1,343],
    [343,  1,  0,  0,  1,334,  0,  1,  0,  1,  0,  1,343],
    [343,  1, 33,  0,211,218,  1,  1,  0, 82,  0,  1,343],
    [343,  1,  1,  1,  0,  0,  0,  1,334,  1, 11,  1,343],
    [343, 88,  0, 82,  0,  0, 28,  1, 27,  1, 55,  1,343],
    [343,343,343,343,343,343,343,343,343,343,343,343,343]
],
    "bgmap": [

],
    "fgmap": [

],
    "downFloor": [
        1,
        11
    ],
    "upFloor": null,
    "underGround": true,
    "beforeBattle": {}
}