main.floors.FT6=
{
    "floorId": "FT6",
    "title": "密室 #5",
    "name": "密室",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canFlyFrom": true,
    "canUseQuickShop": false,
    "cannotViewMap": false,
    "images": [],
    "item_ratio": 1,
    "defaultGround": "ground",
    "bgm": "bgm3.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "10,10": {
            "floorId": "B17",
            "loc": [
                6,
                6
            ],
            "time": 500
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [343,343,343,343,343,343,343,343,343,343,343,343,343],
    [343,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,343],
    [343,  1, 31, 31, 31, 81,  0,  1,324,324,324,  1,343],
    [343,  1, 31, 31, 31,  1,  0, 81,323,323,323,  1,343],
    [343,  1,  1,  1,  1,  1,361,  1,  1,  1,  1,  1,343],
    [343,  1,  0,361,  0,  0,  0,  0,  0,  0,  0,  1,343],
    [343,  1,  0,  0,361,  1,  1, 86,  1,  1,361,  1,343],
    [343,  1,361,  0,198,  1, 27, 28, 33,  1,  0,  1,343],
    [343,  1,  1, 86,  1,  1, 59, 59, 59,  1,361,  1,343],
    [343,  1, 58, 58, 58,  1,  1,  1,  1,  1,  0,  1,343],
    [343,  1, 58, 58, 58,  1,  1,  1,  1,  1,376,  1,343],
    [343,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,343],
    [343,343,343,343,343,343,343,343,343,343,343,343,343]
],
    "bgmap": [

],
    "fgmap": [

],
    "beforeBattle": {},
    "cannotMoveIn": {}
}