main.floors.HG4=
{
    "floorId": "HG4",
    "title": "皇宫 #1",
    "name": "皇宫",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "item_ratio": 1,
    "defaultGround": "ground",
    "bgm": "bgm4.mp3",
    "firstArrive": [
        {
            "type": "function",
            "function": "function(){\ncore.plugin.getAchievement(28);\n}"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,2": [
            "\t[勇者,hero]真不妙...已经到处都是魔物了...",
            "\t[公主,princess]我很担心父皇呢...不知道他怎么了...",
            "\t[勇者,hero]不用担心...我答应你一定会将国皇救出！",
            "\t[公主,princess]谢谢你...我们继续寻找吧。不过要小心魔物...它们好像都很凶恶。",
            "\t[勇者,hero]明白了",
            {
                "type": "hide",
                "time": 0
            }
        ],
        "10,3": [
            "\t[公主,princess]看...这大概是皇宫内守卫的亡灵吧...真可怜...对不起你们...",
            "\t[勇者,hero]可恶的魔物，竟然还到处杀人...！我一定要把他们...",
            "\t[公主,princess]等等！我的头饰对这些亡灵有点反应，我能听到他们的声音！",
            "\t[亡灵之火,A304]公主陛下...战士...很抱歉我们的实力并不足以保护这里...现在我们都这个样子了...",
            "\t[亡灵之火,A304]可是我还想战斗...公主陛下，请你允许我们经由陛下你的头饰将力量传达给这位战士...",
            "\t[亡灵之火,A304]我们能够借此回复战士的一格气息...希望这样能帮助到你们...",
            "\t[公主,princess]好...太好了，有你们的帮忙，我们的冒险必定会更加顺利。",
            {
                "type": "hide",
                "time": 0
            }
        ]
    },
    "changeFloor": {
        "6,11": {
            "floorId": "HG2",
            "loc": [
                4,
                11
            ],
            "time": 500
        },
        "6,1": {
            "floorId": "HG5",
            "loc": [
                6,
                11
            ],
            "time": 500
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [343,343,343,343,343,343,343,343,343,343,343,343,343],
    [343,349,349,349,350,349,10033,349,350,349,349,349,343],
    [343,350, 27, 28,  0,351,  0,351,  0,348,304,349,343],
    [343,349, 21, 21,  0,237,  0,237,  0,353,  0,349,343],
    [343,349,  0,353,  0,  0,353,  0,  0,  0,  0,349,343],
    [343,350,353,434,  0,351,  0,348,  0,353,  0,350,343],
    [343,349,  0,  0,  0,  0,  0,  0,434,  0,  0,350,343],
    [343,349,  0,353,  0,351,  0,351,  0,  0,353,349,343],
    [343,350,355,355,355,355,355,355,355,355,355,349,343],
    [343,349,169,169,169,169,169,169,169,169,169,349,343],
    [343,349,358,169,169,169,169,169,169,169,168,350,343],
    [343,349,357,170,170,170,354,170,170,170,356,349,343],
    [343,343,343,343,343,343,343,343,343,343,343,343,343]
],
    "bgmap": [

],
    "fgmap": [

],
    "beforeBattle": {},
    "cannotMoveIn": {}
}