main.floors.MT11=
{
    "floorId": "MT11",
    "title": "主塔 11F",
    "name": "11",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "item_ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "10,11": [
            {
                "type": "if",
                "condition": "(switch:A==true)",
                "true": [
                    "\t[亲切老人,man]具体用法是按了 X 后再按一次Enter。记住了? ",
                    "\t[勇者,hero]都记住了，谢谢!",
                    "注：手机版请在心镜中直接单击某个怪物查看详细信息。"
                ],
                "false": [
                    "\t[亲切老人,man]小兄弟你等一下。\n你胸前的这个不就是心镜吗?",
                    "\t[勇者,hero]啊，是的。",
                    "\t[亲切老人,man]而且你还是个战士...大概你也知道了它的基本用法吧?",
                    "\t[勇者,hero]没错，只要有它就可以查看怪物的能力，是个十分方便的东西。",
                    "\t[亲切老人,man]呵呵呵，那我教你它的隐藏用法吧!\n在往后的冒险中一定能帮到你的。",
                    "\t[亲切老人,man]只要你在发动它的功能后再注入一点力量，那么你就能看到更深入的预测资料啊!",
                    "\t[亲切老人,man]具体用法是按了 X 后再按一次Enter。记住了? ",
                    "\t[勇者,hero]都记住了，谢谢!",
                    "系统提示：\n复刻版中，在心镜直接单击怪物以查看详细信息。",
                    {
                        "type": "setValue",
                        "name": "switch:A",
                        "value": "true"
                    },
                    {
                        "type": "function",
                        "function": "function(){\ncore.plugin.getAchievement(25);\ncore.addFlag('talkedCount', 1);\nif (core.getFlag('talkedCount', 0) >= 17) core.plugin.getAchievement(17);\n}"
                    }
                ]
            }
        ],
        "10,1": [
            "\t[小贼,thief]战斗时疲劳太高可是会很不妙的！",
            "\t[小贼,thief]因为疲劳会影响到你攻击的命中率，\n越是疲劳，命中越低。",
            "\t[小贼,thief]疲劳的极限是100，当达至或超过此数\n值时，你的攻击就会完全打不中对手。",
            "\t[小贼,thief]而使用特殊技能是导致疲劳的主因，\n每当战斗完结的时候，疲劳就会回复。",
            "\t[小贼,thief]当然，你也可以使用气息作一个深呼吸，\n用来回复疲劳。",
            "\t[小贼,thief]按 V 就是深呼吸，要花费一格气息。",
            "系统提示：\n复刻版疲劳小于100时命中率为100%；\n深呼吸同样要在技能面板中使用。"
        ]
    },
    "changeFloor": {
        "2,2": {
            "floorId": ":before",
            "time": 500
        },
        "3,8": {
            "floorId": ":next",
            "time": 500
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [343,343,343,343,343,343,343,343,343,343,343,343,343],
    [343,  1,  1,  1,  1,  1,  1, 33, 33,  1,123,  1,343],
    [343,  1, 88,213, 21, 21,  1,  0,  0,  1,  0,  0,343],
    [343,  1,  1,226,  1, 21,  1,  0,216, 82,329,  0,343],
    [343,  1,  1,224,  1,  0, 81,253,  0,  1,  0,  0,343],
    [343,  1,  1, 28,  1,  0,  1,  0,  0,  1,  0,  1,343],
    [343,  1,  1, 31,  1,226,  1, 32, 31,  1, 58,  1,343],
    [343, 32,  1,  1,  1,253,  1,  1,  1,  1,  1,  1,343],
    [343, 27,  1, 87,  1,226,  1,  0, 31,  1,  0, 22,343],
    [343,226,  1,  0,  1,  0, 81,253,216, 81,210,  0,343],
    [343,213,  1,215,  1,  0,  1,  0, 21,  1,  0,  1,343],
    [343,  0,  0,253,  0,  0,  1,  1,  1,  1,121,  1,343],
    [343,343,343,343,343,343,343,343,343,343,343,343,343]
],
    "bgmap": [

],
    "fgmap": [

],
    "bgm": "bgm1.mp3",
    "beforeBattle": {},
    "cannotMoveIn": {}
}