main.floors.MT14=
{
    "floorId": "MT14",
    "title": "主塔 14F",
    "name": "14",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "item_ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "11,3": [
            "\t[学者,man]防御临界值是一门高深的学问哩！",
            "\t[学者,man]当你的防御力比\n(怪物的攻击力+此临界值)\n高，那么它也只能替你抓痒！哈哈。",
            "\t[学者,man]初始防御临界值为40，每获得一个防御技便-6.",
            "\t[学者,man]此时你的防御临界值是：${core.getFlag('defm',40)}"
        ]
    },
    "changeFloor": {
        "5,11": {
            "floorId": ":before",
            "time": 500
        },
        "7,11": {
            "floorId": ":before",
            "time": 500
        },
        "6,1": {
            "floorId": ":next",
            "time": 500
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [343,343,343,343,343,343,343,343,343,343,343,343,343],
    [343,  2,  2,  2,  2,  2, 87,  2,  2,  2,  2,  2,343],
    [343, 27,  0,329,210,  0,  0,  0,329,  0,224,  0,343],
    [343, 28,  0,329,  2,  0,  0,  0,329,  0,  2,121,343],
    [343,  2,  2,  2,  2,  2,  0,  2,  2,  2,  2,  2,343],
    [343, 26,  2,  0,  0,224,  0,224,  0,  0,  2, 53,343],
    [343,  0,204,  0,  0,224,  0,224,  0,  0,222,  0,343],
    [343,  2,  2,  2,  2,  2,  0,  2,  2,  2,  2,  2,343],
    [343, 27,  0,210, 82,329,  0,329, 81,210,  0, 28,343],
    [343, 27,  0,  0,  2,  2,210,  2,  2,  0,  0, 28,343],
    [343,  0,  0,  0,  2,  0,  0,  0,  2,  0,  0,  0,343],
    [343, 21, 21, 21,  2, 88,  0, 88,  2, 31, 31, 31,343],
    [343,343,343,343,343,343,343,343,343,343,343,343,343]
],
    "bgmap": [

],
    "fgmap": [

],
    "downFloor": [
        5,
        11
    ],
    "bgm": "bgm1.mp3",
    "beforeBattle": {},
    "cannotMoveIn": {}
}