main.floors.MT20=
{
    "floorId": "MT20",
    "title": "主塔 20F",
    "name": "20",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "item_ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "11,11": [
            "\t[老人,man]你知道什么是攻击临界值吗？",
            "\t[勇者,hero]这是什么？",
            "\t[老人,man]当怪物的防御力比\n(你的攻击力+临界值)\n高，这时你就一点也伤不了它！",
            "\t[老人,man]初始攻击临界值为10，每获得一个剑技便+6.",
            "\t[老人,man]此时你的攻击临界值是：${core.getFlag('atkm',10)}"
        ],
        "1,1": [
            "\t[商人,woman]刚刚看见一个好像是公主的女孩\n被两名侍卫捉到了更上的层数。"
        ],
        "5,7": [
            "\t[神秘老人,N409]除了剑技外，防御术也是十分有用的护身之术。",
            "\t[神秘老人,N409]在你学会后，可因应情况发动防御术来减少伤害！\n某些防御术还有特殊效果啊！",
            "\t[神秘老人,N409]当然你也只能装备一种防御术。\n当学会防御术后，按 H 键就可进入装备页了。\nH5快捷键 Q 。",
            "\t[神秘老人,N409]在战斗中，按 X 键就发动已装备的防御术。"
        ]
    },
    "changeFloor": {
        "1,11": {
            "floorId": ":before",
            "time": 500
        },
        "8,7": {
            "floorId": "MT21b",
            "time": 500
        },
        "4,2": {
            "floorId": ":next",
            "time": 500
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [343,343,343,343,343,343,343,343,343,343,343,343,343],
    [343,122,  0,  0,218,  0,  0,  0,  0,  0,  0,  0,343],
    [343,  0,  0,232, 87,207,  0,  0,  0,  0,332,  0,343],
    [343,  2,  2,332,  2,  2,  2,  2,  2,  2,207,  2,343],
    [343,  0,  0,207,  0, 21,361,  2, 27,  0,334,  0,343],
    [343,232,  0,  0,  0,  0, 21,  2, 32, 28,  0,  0,343],
    [343,332,  2,  2,  2,  2,  2,  2,  2,  2,  2,  2,343],
    [343,207,  0,  0, 31,409,  2,214, 87,214,  0, 22,343],
    [343,  0,  0,  0,  0, 31,  2,  0,334,  0,  0, 59,343],
    [343,  0,  0,  0,  0,  0,  2,  0,  0,  0,  0, 58,343],
    [343,  0,  0,  0,  0,  0,  2,  0,  0,  0,  0,198,343],
    [343, 88,  0,  0,  0,232,218,211,  0,  0,  0,121,343],
    [343,343,343,343,343,343,343,343,343,343,343,343,343]
],
    "bgmap": [

],
    "fgmap": [

],
    "upFloor": [
        4,
        2
    ],
    "bgm": "bgm1.mp3",
    "beforeBattle": {}
}