main.floors.MT7=
{
    "floorId": "MT7",
    "title": "主塔 7F",
    "name": "7",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "item_ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [],
    "events": {
        "4,1": [
            "\t[老人,man]气息在战斗中会透过攻防来增加，当气息条达至上限就能增加一点气息以供使出技能之用！",
            "\t[老人,man]而你当前气息条的上限是${hero.manamax/6}。"
        ],
        "4,9": [
            "\t[持剑老人,N409]你知道甚么是剑技吗?",
            "\t[持剑老人,N409]剑技是很有用的东西，不同剑技会有不同效果。",
            "\t[持剑老人,N409]当学会剑技后，按W键就可进入装备页了。\nH5快捷键为Q。",
            "\t[持剑老人,N409]在战斗中，按Z就发动已装备的剑技。",
            "系统提示：\n复刻版须在战斗前呼出技能面板（快捷键6）并输入 Z 来发动剑技。"
        ]
    },
    "changeFloor": {
        "4,7": {
            "floorId": "MT6",
            "time": 500
        },
        "2,4": {
            "floorId": "MT8",
            "time": 500
        }
    },
    "afterBattle": {},
    "afterGetItem": {
        "9,6": [
            {
                "type": "addValue",
                "name": "status:atk",
                "value": "5"
            },
            {
                "type": "addValue",
                "name": "flag:atkm",
                "value": "6"
            }
        ]
    },
    "afterOpenDoor": {},
    "cannotMove": {},
    "map": [
    [343,343,343,343,343,343,343,343,343,343,343,343,343],
    [343,  1,  1,  1,121,  0,  0,  0,  0,  0,  0, 58,343],
    [343,  1,  1,  1,  0,  0,  1,  0,  1,  0,  1,209,343],
    [343,  1,  1,  1,217,  1,  1,209,  1,203,  1, 31,343],
    [343,  1, 87,  1,203,  1,  0,  0,  1,  0,  1, 21,343],
    [343,  1,  0,  1,217,  1,203,  1,  1, 82,  1, 22,343],
    [343,  1,206,  1,  0,  1,  0,  0,  1,315,  1,  0,343],
    [343,  1,221,  1, 88,  1,  1,  0,  1, 82,  1, 81,343],
    [343,  1, 81,  1,  1,  1,217,206,213,  0,  1, 81,343],
    [343,  1,  0,  1,409,  1,  0,  1,  1,  1,  1,  0,343],
    [343,  1,  0,  0,  0,  0,  0,  0,221,206,  1,  0,343],
    [343,  1,  1,  1,  1,  1,  1,  1,  1,213, 28, 27,343],
    [343,343,343,343,343,343,343,343,343,343,343,343,343]
],
    "bgmap": [

],
    "fgmap": [

],
    "upFloor": null,
    "downFloor": null,
    "autoEvent": {},
    "bgm": "bgm1.mp3",
    "beforeBattle": {}
}